/**
 * kaomoji emoticons - a collection of expressive, text-based unicode faces...
 */
export default
{
  smile     : [ '( ͡° ͜ʖ ͡°)', '( ͡~ ͜ʖ ͡~)', '(⌐■_■)', '(°‿°)' ],
  happy     : [ '(｡♥‿♥｡)', '(≧◡≦)', '(๑˃ᴗ˂)ﻭ', '(๑>ᴗ<๑)', '｡^‿^｡', '٩(◕‿◕｡)۶', '♪ ᕕ( ᐛ )ᕗ ♪' ],
  confused  : [ '¯\\_(ツ)_/¯', '¯\\(°_o)/¯', '(°ロ°) !?', '⊙﹏⊙' ],
  sad       : [ '(╥﹏╥)', '(╯︵╰,)', '(ಥ﹏ಥ)', '(ಥ_ಥ)', '(T︵T)', '(｡•︵•｡)' ],
  angry     : [ 'ಠ╭╮ಠ', '(ಠ‸ಠ)', '(╯°□°）╯︵ ┻━┻', '┻━┻︵ ¯\\(°□°)/¯', 'ᕦ︵(ò_óˇ)ᕤ', 'ᕙ( ò╭╮ó)ᕗ', 'G-(•‸•G)' ],
  corrected : [ '┬─┬ ノ( ゜-゜ノ)', '(￣^￣)ゞ' ]
}
